Revit 2027 API
NavisworksExportOptions.ExportScope Property
 Options which specifies the export scope of Navisworks Exporter. Default value is Model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public NavisworksExportScope ExportScope { get; set; }
Public Property ExportScope As NavisworksExportScope
	Get
	Set
public:
property NavisworksExportScope ExportScope {
	NavisworksExportScope get ();
	void set (NavisworksExportScope value);
}
member ExportScope : NavisworksExportScope with get, set
Property Value
NavisworksExportScope
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace